mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_tone.c
#include "jm_stm32.h"
#include "jm_stm32_com.h"

#if defined(USE_HAL_UART)
#include "stm32f1xx_hal.h"
#else
#include <stm32f1xx.h>
#endif

#define SYSTEM_CLOCK 72000000

static GPIO_TypeDef *pin_to_port(uint32_t pin) {
    if (pin < 16) return GPIOA;
    else if (pin < 32) return GPIOB;
    return NULL;
}

static uint16_t pin_to_mask(uint32_t pin) {
    if (pin < 16) return (uint16_t)(1 << pin);
    else if (pin < 32) return (uint16_t)(1 << (pin - 16));
    return 0;
}

#if JM_TONE_ENABLE==1

typedef struct {
    uint32_t pin;
    GPIO_TypeDef *port;
    uint16_t pinMask;
    TIM_TypeDef *tim;
    uint8_t channel;
} tone_info_t;

static tone_info_t g_tone_infos[4] = {0};
static uint8_t g_tone_info_count = 0;

static tone_info_t *tone_find_info(uint32_t pin) {
    for (int i = 0; i < g_tone_info_count; i++) {
        if (g_tone_infos[i].pin == pin) {
            return &g_tone_infos[i];
        }
    }
    return NULL;
}

static tone_info_t *tone_alloc_info(uint32_t pin, GPIO_TypeDef *port, uint16_t pinMask, TIM_TypeDef *tim, uint8_t channel) {
    if (g_tone_info_count >= 4) return NULL;
    tone_info_t *info = &g_tone_infos[g_tone_info_count++];
    info->pin = pin;
    info->port = port;
    info->pinMask = pinMask;
    info->tim = tim;
    info->channel = channel;
    return info;
}



static void pin_to_timer(uint32_t pin, TIM_TypeDef **tim, uint8_t *channel) {
    *tim = NULL;
    *channel = 0;
    switch (pin) {
        case 0: *tim = TIM2; *channel = 1; break;
        case 1: *tim = TIM2; *channel = 2; break;
        case 2: *tim = TIM2; *channel = 3; break;
        case 3: *tim = TIM2; *channel = 4; break;
        case 6: *tim = TIM3; *channel = 1; break;
        case 7: *tim = TIM3; *channel = 2; break;
        case 8: *tim = TIM3; *channel = 3; break;
        case 9: *tim = TIM3; *channel = 4; break;
        default: break;
    }
}

static void tone_set_pin_af_pp(uint32_t pin) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    if (port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (pinMask & (1 << i)) { pin_no = i; break; }
    }

    if (pin_no < 8) {
        uint32_t cr_reg = port->CRL;
        cr_reg &= ~(0xF << (pin_no * 4));
        cr_reg |= (0xB << (pin_no * 4));
        port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = port->CRH;
        cr_reg &= ~(0xF << ((pin_no - 8) * 4));
        cr_reg |= (0xB << ((pin_no - 8) * 4));
        port->CRH = cr_reg;
    }
}

static void tone_set_pin_input(uint32_t pin) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    uint8_t pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (pinMask & (1 << i)) { pin_no = i; break; }
    }

    if (pin_no < 8) {
        uint32_t cr_reg = port->CRL;
        cr_reg &= ~(0xF << (pin_no * 4));
        cr_reg |= (0x1 << (pin_no * 4));
        port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = port->CRH;
        cr_reg &= ~(0xF << ((pin_no - 8) * 4));
        cr_reg |= (0x1 << ((pin_no - 8) * 4));
        port->CRH = cr_reg;
    }
}

static void tone_enable_clock(TIM_TypeDef *tim) {
    if (tim == TIM2) RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
    else if (tim == TIM3) RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;
}

static void noTone(uint32_t pin);

static void tone(uint32_t pin, uint32_t freq, uint32_t duration) {
    if (freq == 0) return;

    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    TIM_TypeDef *tim;
    uint8_t channel;
    pin_to_timer(pin, &tim, &channel);
    if (!tim) return;

    tone_info_t *info = tone_find_info(pin);
    if (info) {
        info->tim->CR1 &= ~TIM_CR1_CEN;
    }

    tone_set_pin_af_pp(pin);
    tone_enable_clock(tim);

    uint32_t period = SYSTEM_CLOCK / freq;
    uint32_t psc = 0;
    uint32_t arr = period - 1;

    if (arr > 65535) {
        psc = period / 65536;
        if (psc == 0) psc = 1;
        arr = period / psc;
        if (arr > 65535) arr = 65535;
        if (arr == 0) arr = 1;
    }

    tim->CR1 = 0;
    tim->PSC = psc;
    tim->ARR = arr;
    tim->CCMR1 = 0;
    tim->CCMR2 = 0;
    tim->CCER = 0;

    uint32_t ccr = arr / 2;
    switch (channel) {
        case 1:
            tim->CCMR1 |= (0x6 << 4) | (1 << 3);
            tim->CCR1 = ccr;
            tim->CCER |= TIM_CCER_CC1E;
            break;
        case 2:
            tim->CCMR1 |= (0x6 << 12) | (1 << 11);
            tim->CCR2 = ccr;
            tim->CCER |= TIM_CCER_CC2E;
            break;
        case 3:
            tim->CCMR2 |= (0x6 << 4) | (1 << 3);
            tim->CCR3 = ccr;
            tim->CCER |= TIM_CCER_CC3E;
            break;
        case 4:
            tim->CCMR2 |= (0x6 << 12) | (1 << 11);
            tim->CCR4 = ccr;
            tim->CCER |= TIM_CCER_CC4E;
            break;
        default:
            return;
    }

    tim->CR1 |= TIM_CR1_CEN;

    if (info == NULL) {
        info = tone_alloc_info(pin, port, pinMask, tim, channel);
    }

    if (duration > 0) {
        jm_delay_ms(duration);
        noTone(pin);
    }
}

static void noTone(uint32_t pin) {
    tone_info_t *info = tone_find_info(pin);
    if (info == NULL) return;

    info->tim->CR1 &= ~TIM_CR1_CEN;
    tone_set_pin_input(pin);
}

static void tone_set_pin_output(uint32_t pin) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return;

    if (port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (pinMask & (1 << i)) { pin_no = i; break; }
    }

    if (pin_no < 8) {
        uint32_t cr_reg = port->CRL;
        cr_reg &= ~(0xF << (pin_no * 4));
        cr_reg |= (0x3 << (pin_no * 4));
        port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = port->CRH;
        cr_reg &= ~(0xF << ((pin_no - 8) * 4));
        cr_reg |= (0x3 << ((pin_no - 8) * 4));
        port->CRH = cr_reg;
    }
}

static uint32_t tone_pulseIn(uint32_t pin, uint8_t state, uint32_t timeout_us) {
    GPIO_TypeDef *port = pin_to_port(pin);
    uint16_t pinMask = pin_to_mask(pin);
    if (!port || !pinMask) return 0;

