mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_tone.c
    tone_set_pin_input(pin);

    uint32_t systick_ctrl = SysTick->CTRL;
    uint32_t systick_load = SysTick->LOAD;

    SysTick->LOAD = 0xFFFFFF;
    SysTick->VAL = 0;
    SysTick->CTRL = 5;

    uint32_t start = SysTick->VAL;
    while (((port->IDR & pinMask) ? 1 : 0) != state) {
        if ((start - SysTick->VAL) / 72 > timeout_us) {
            SysTick->CTRL = 0;
            SysTick->LOAD = systick_load;
            SysTick->VAL = 0;
            SysTick->CTRL = systick_ctrl;
            return 0;
        }
    }

    uint32_t pulse_start = SysTick->VAL;
    while (((port->IDR & pinMask) ? 1 : 0) == state) {
        if ((pulse_start - SysTick->VAL) / 72 > timeout_us) {
            SysTick->CTRL = 0;
            SysTick->LOAD = systick_load;
            SysTick->VAL = 0;
            SysTick->CTRL = systick_ctrl;
            return 0;
        }
    }

    uint32_t pulse_end = SysTick->VAL;

    SysTick->CTRL = 0;
    SysTick->LOAD = systick_load;
    SysTick->VAL = 0;
    SysTick->CTRL = systick_ctrl;

    uint32_t elapsed = (pulse_start >= pulse_end) ? (pulse_start - pulse_end) : (0x1000000 - pulse_end + pulse_start);
    return elapsed / 72;
}

static uint32_t tone_pulseInLong(uint32_t pin, uint8_t state, uint32_t timeout_us) {
    return tone_pulseIn(pin, state, timeout_us);
}

static uint8_t tone_shiftIn(uint32_t dataPin, uint32_t clockPin, uint8_t bitOrder) {
    uint8_t value = 0;
    uint8_t i;

    GPIO_TypeDef *clkPort = pin_to_port(clockPin);
    uint16_t clkMask = pin_to_mask(clockPin);
    GPIO_TypeDef *dataPort = pin_to_port(dataPin);
    uint16_t dataMask = pin_to_mask(dataPin);

    if (!clkPort || !dataPort) return 0;

    if (clkPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (clkPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (dataPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (dataPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    tone_set_pin_output(clockPin);
    tone_set_pin_input(dataPin);

    for (i = 0; i < 8; i++) {
        clkPort->BSRR = clkMask;

        if (dataPort->IDR & dataMask) {
            if (bitOrder == 0) {
                value |= (1 << i);
            } else {
                value |= (1 << (7 - i));
            }
        }

        clkPort->BSRR = ((uint32_t)clkMask << 16);
    }

    return value;
}

static void tone_shiftOut(uint32_t dataPin, uint32_t clockPin, uint8_t bitOrder, uint8_t val) {
    GPIO_TypeDef *clkPort = pin_to_port(clockPin);
    uint16_t clkMask = pin_to_mask(clockPin);
    GPIO_TypeDef *dataPort = pin_to_port(dataPin);
    uint16_t dataMask = pin_to_mask(dataPin);

    if (!clkPort || !dataPort) return;

    if (clkPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (clkPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (dataPort == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (dataPort == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    tone_set_pin_output(clockPin);
    tone_set_pin_output(dataPin);

    clkPort->BSRR = ((uint32_t)clkMask << 16);

    for (int i = 0; i < 8; i++) {
        uint8_t bit;
        if (bitOrder == 0) {
            bit = (val >> i) & 1;
        } else {
            bit = (val >> (7 - i)) & 1;
        }

        if (bit) {
            dataPort->BSRR = dataMask;
        } else {
            dataPort->BSRR = ((uint32_t)dataMask << 16);
        }

        clkPort->BSRR = clkMask;
        clkPort->BSRR = ((uint32_t)clkMask << 16);
    }
}
#endif // JM_TONE_ENABLE==1

#if JM_AT24CXX_ENABLE==1

#define EEPROM_I2C_ADDRESS 0x50
#define EEPROM_I2C_TIMEOUT 10000

static I2C_TypeDef *eeprom_i2c = I2C1;
static bool eeprom_i2c_inited = false;

static bool i2c_wait_sr1(uint32_t flag) {
    int timeout = EEPROM_I2C_TIMEOUT;
    while (!(eeprom_i2c->SR1 & flag)) {
        if (--timeout <= 0) return false;
    }
    return true;
}

static bool i2c_start(void) {
    eeprom_i2c->CR1 |= I2C_CR1_START;
    return i2c_wait_sr1(I2C_SR1_SB);
}

static void i2c_stop(void) {
    eeprom_i2c->CR1 |= I2C_CR1_STOP;
}

static bool i2c_send_addr(uint8_t addr, bool read) {
    eeprom_i2c->DR = (addr << 1) | (read ? 1 : 0);
    return i2c_wait_sr1(I2C_SR1_ADDR);
}

static bool i2c_write_byte(uint8_t data) {
    eeprom_i2c->DR = data;
    return i2c_wait_sr1(I2C_SR1_TXE);
}

static uint8_t i2c_read_byte(bool ack) {
    if (!ack) eeprom_i2c->CR1 &= ~I2C_CR1_ACK;
    while (!(eeprom_i2c->SR1 & I2C_SR1_RXNE));
    return eeprom_i2c->DR;
}

static bool eeprom_i2c_init(uint8_t sda, uint8_t scl) {
    GPIO_TypeDef *sda_port = pin_to_port(sda);
    GPIO_TypeDef *scl_port = pin_to_port(scl);
    uint16_t sda_mask = pin_to_mask(sda);
    uint16_t scl_mask = pin_to_mask(scl);
    if (!sda_port || !scl_port) return false;

    if (sda_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (sda_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (scl_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (scl_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t sda_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (sda_mask & (1 << i)) { sda_pin_no = i; break; }
    }
    uint8_t scl_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (scl_mask & (1 << i)) { scl_pin_no = i; break; }
    }

    if (sda_pin_no < 8) {
        uint32_t cr_reg = sda_port->CRL;
        cr_reg &= ~(0xF << (sda_pin_no * 4));
        cr_reg |= (0xE << (sda_pin_no * 4));
        sda_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = sda_port->CRH;
        cr_reg &= ~(0xF << ((sda_pin_no - 8) * 4));
        cr_reg |= (0xE << ((sda_pin_no - 8) * 4));
        sda_port->CRH = cr_reg;
    }

    if (scl_pin_no < 8) {
        uint32_t cr_reg = scl_port->CRL;
        cr_reg &= ~(0xF << (scl_pin_no * 4));
        cr_reg |= (0xE << (scl_pin_no * 4));
        scl_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = scl_port->CRH;
        cr_reg &= ~(0xF << ((scl_pin_no - 8) * 4));
        cr_reg |= (0xE << ((scl_pin_no - 8) * 4));
        scl_port->CRH = cr_reg;
    }

    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

