mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_tone.c
    RCC->APB1RSTR |= RCC_APB1RSTR_I2C1RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_I2C1RST;

    eeprom_i2c->CR1 = 0;
    eeprom_i2c->CR2 = 72;
    eeprom_i2c->CCR = 360;
    eeprom_i2c->TRISE = 73;
    eeprom_i2c->CR1 |= I2C_CR1_PE;

    eeprom_i2c_inited = true;
    return true;
}

static bool eeprom_write_byte(uint16_t addr, uint8_t data) {
    if (!i2c_start()) return false;
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, false)) return false;
    if (!i2c_write_byte(addr >> 8)) return false;
    if (!i2c_write_byte(addr & 0xFF)) return false;
    if (!i2c_write_byte(data)) return false;
    i2c_stop();
    jm_delay_ms(10);
    return true;
}

static uint8_t eeprom_read_byte(uint16_t addr) {
    if (!i2c_start()) return 0;
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, false)) return 0;
    if (!i2c_write_byte(addr >> 8)) return 0;
    if (!i2c_write_byte(addr & 0xFF)) return 0;

    i2c_start();
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, true)) return 0;

    uint8_t data = i2c_read_byte(false);
    i2c_stop();
    return data;
}

static bool eeprom_read_bytes(uint16_t addr, uint8_t *buf, uint8_t len) {
    if (!i2c_start()) return false;
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, false)) return false;
    if (!i2c_write_byte(addr >> 8)) return false;
    if (!i2c_write_byte(addr & 0xFF)) return false;

    i2c_start();
    if (!i2c_send_addr(EEPROM_I2C_ADDRESS, true)) return false;

    for (int i = 0; i < len; i++) {
        bool last = (i == len - 1);
        buf[i] = i2c_read_byte(!last);
    }
    i2c_stop();
    return true;
}

static void eeprom_scan_devices(void) {
    for (uint8_t addr = 8; addr < 120; addr++) {
        if (!i2c_start()) continue;
        i2c_send_addr(addr, false);
        i2c_stop();
    }
}

jm_emap_t* jm_stm32_at24cxx_call(jm_emap_t *ps) {
    jm_emap_t *rst = jm_emap_create(PREFIX_TYPE_STRINGG);
    jm_emap_putByte(rst, (void*)"code", 0, false);

    uint8_t op = (uint8_t)jm_emap_getInt(ps, (void*)"op", 0);

    switch(op) {
        case 54: {
            uint8_t sda = (uint8_t)jm_emap_getInt(ps, (void*)"d", 0);
            uint8_t scl = (uint8_t)jm_emap_getInt(ps, (void*)"c", 0);
            if(!eeprom_i2c_init(sda, scl)) {
                jm_emap_putByte(rst, (void*)"code", 1, false);
            }
        }
        break;

        case 55: {
            uint16_t addr = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t v = eeprom_read_byte(addr);
            jm_emap_putByte(rst, (void*)"v", (int8_t)v, false);
        }
        break;

        case 56: {
            uint16_t addra = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t d = (uint8_t)jm_emap_getByte(ps, (void*)"d", 0);
            if(!eeprom_write_byte(addra, d)) {
                jm_emap_putByte(rst, (void*)"code", 1, false);
            }
        }
        break;

        case 57: {
            uint16_t addrb = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t len = (uint8_t)jm_emap_getInt(ps, (void*)"s", 0);
            if(len <= 0 || len > 64) {
                jm_emap_putByte(rst, (void*)"code", 1, false);
            } else {
                uint8_t buf[64];
                if(!eeprom_read_bytes(addrb, buf, len)){
                    jm_emap_putByte(rst, (void*)"code", 3, false);
                } else {
                    for (int i = 0; i < len; i++) {
                        jm_emap_putByte(rst, (void*)"v", (int8_t)buf[i], false);
                    }
                }
            }
        }
        break;

        case 58: {
            uint16_t addrc = (uint16_t)jm_emap_getInt(ps, (void*)"a", 0);
            uint8_t d = (uint8_t)jm_emap_getByte(ps, (void*)"d", 0);
            bool suc = eeprom_write_byte(addrc, d);
            jm_emap_putByte(rst, (void*)"v", suc ? 1 : 0, false);
        }
        break;

        case 59: {
            eeprom_scan_devices();
        }
        break;

        default:
            jm_emap_putByte(rst, (void*)"code", 100, false);
    }

    return rst;
}

#endif // JM_AT24CXX_ENABLE==1

#if JM_I2C_WRAPPER_ENABLE==1

#define I2C_MAX_WIRES 4

typedef struct {
    uint16_t wireId;
    GPIO_TypeDef *sda_port;
    GPIO_TypeDef *scl_port;
    uint16_t sda_mask;
    uint16_t scl_mask;
    bool initialized;
    bool transmitting;
    uint8_t address;
    uint8_t *rx_buf;
    uint16_t rx_len;
    uint16_t rx_index;
} i2c_wire_t;

static i2c_wire_t i2c_wires[I2C_MAX_WIRES] = {0};
static uint8_t i2c_wire_count = 0;

static i2c_wire_t *i2c_find_wire(uint16_t wireId) {
    for (int i = 0; i < i2c_wire_count; i++) {
        if (i2c_wires[i].wireId == wireId) {
            return &i2c_wires[i];
        }
    }
    return NULL;
}

static i2c_wire_t *i2c_alloc_wire(uint16_t wireId) {
    if (i2c_wire_count >= I2C_MAX_WIRES) return NULL;
    i2c_wire_t *wire = &i2c_wires[i2c_wire_count++];
    wire->wireId = wireId;
    wire->initialized = false;
    wire->transmitting = false;
    wire->rx_buf = NULL;
    wire->rx_len = 0;
    wire->rx_index = 0;
    return wire;
}

static bool i2c_configure_pins(i2c_wire_t *wire) {
    uint8_t sda = wire->wireId & 0xFF;
    uint8_t scl = (wire->wireId >> 8) & 0xFF;

    wire->sda_port = pin_to_port(sda);
    wire->scl_port = pin_to_port(scl);
    wire->sda_mask = pin_to_mask(sda);
    wire->scl_mask = pin_to_mask(scl);
    if (!wire->sda_port || !wire->scl_port) return false;

    if (wire->sda_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (wire->sda_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    if (wire->scl_port == GPIOA) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN;
    else if (wire->scl_port == GPIOB) RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    uint8_t sda_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (wire->sda_mask & (1 << i)) { sda_pin_no = i; break; }
    }
    uint8_t scl_pin_no = 0;
    for (int i = 0; i < 16; i++) {
        if (wire->scl_mask & (1 << i)) { scl_pin_no = i; break; }
    }

    if (sda_pin_no < 8) {
        uint32_t cr_reg = wire->sda_port->CRL;
        cr_reg &= ~(0xF << (sda_pin_no * 4));
        cr_reg |= (0xE << (sda_pin_no * 4));
        wire->sda_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = wire->sda_port->CRH;
        cr_reg &= ~(0xF << ((sda_pin_no - 8) * 4));
        cr_reg |= (0xE << ((sda_pin_no - 8) * 4));
        wire->sda_port->CRH = cr_reg;
    }

    if (scl_pin_no < 8) {
        uint32_t cr_reg = wire->scl_port->CRL;
        cr_reg &= ~(0xF << (scl_pin_no * 4));
        cr_reg |= (0xE << (scl_pin_no * 4));
        wire->scl_port->CRL = cr_reg;
    } else {
        uint32_t cr_reg = wire->scl_port->CRH;
        cr_reg &= ~(0xF << ((scl_pin_no - 8) * 4));
        cr_reg |= (0xE << ((scl_pin_no - 8) * 4));
        wire->scl_port->CRH = cr_reg;
    }

