mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32_tone.c
    return true;
}

static bool i2cw_wait_sr1(I2C_TypeDef *i2c, uint32_t flag, int timeout) {
    while (timeout--) {
        if (i2c->SR1 & flag) return true;
    }
    return false;
}

static bool i2cw_start(I2C_TypeDef *i2c) {
    i2c->CR1 |= I2C_CR1_START;
    return i2cw_wait_sr1(i2c, I2C_SR1_SB, 10000);
}

static void i2cw_stop(I2C_TypeDef *i2c) {
    i2c->CR1 |= I2C_CR1_STOP;
}

static bool i2cw_send_addr(I2C_TypeDef *i2c, uint8_t addr, bool read) {
    i2c->DR = (addr << 1) | (read ? 1 : 0);
    return i2cw_wait_sr1(i2c, I2C_SR1_ADDR, 10000);
}

static bool i2cw_write(I2C_TypeDef *i2c, uint8_t data) {
    i2c->DR = data;
    return i2cw_wait_sr1(i2c, I2C_SR1_TXE, 10000);
}

static uint8_t i2cw_read(I2C_TypeDef *i2c, bool ack) {
    if (!ack) i2c->CR1 &= ~I2C_CR1_ACK;
    while (!(i2c->SR1 & I2C_SR1_RXNE));
    return i2c->DR;
}

int8_t jm_i2c_begin(uint16_t wireId, uint8_t address) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire) wire = i2c_alloc_wire(wireId);
    if (!wire) return -1;

    if (!i2c_configure_pins(wire)) return -1;

    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;
    RCC->APB1RSTR |= RCC_APB1RSTR_I2C1RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_I2C1RST;

    I2C1->CR1 = 0;
    I2C1->CR2 = 72;
    I2C1->CCR = 360;
    I2C1->TRISE = 73;
    I2C1->CR1 |= I2C_CR1_PE;

    wire->initialized = true;
    wire->address = address;
    wire->transmitting = false;
    return 0;
}

int8_t jm_i2c_set_clock(uint16_t wireId, uint32_t clock) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    uint32_t ccr = 72000000 / (2 * clock);
    I2C1->CCR = ccr;
    I2C1->TRISE = (72000000 / 1000000) + 1;
    return 0;
}

int8_t jm_i2c_begin_transmission(uint16_t wireId, uint8_t address) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    wire->address = address;
    wire->transmitting = true;
    return 0;
}

int8_t jm_i2c_end_transmission(uint16_t wireId, bool releaseBus) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    i2cw_stop(I2C1);
    wire->transmitting = false;
    return 0;
}

int8_t jm_i2c_request_from(uint16_t wireId, uint8_t address, uint16_t size, bool stop) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    wire->address = address;
    wire->rx_len = size;
    wire->rx_index = 0;

    if (!i2cw_start(I2C1)) return -1;
    if (!i2cw_send_addr(I2C1, address, true)) return -1;

    I2C1->CR1 |= I2C_CR1_ACK;

    if (stop) {
        wire->transmitting = false;
    }

    return size;
}

int8_t jm_i2c_write_byte(uint16_t wireId, uint8_t data) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    if (!i2cw_write(I2C1, data)) return -1;
    return 0;
}

int8_t jm_i2c_write_buffer(uint16_t wireId, const uint8_t *data, uint16_t size) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    for (uint16_t i = 0; i < size; i++) {
        if (!i2cw_write(I2C1, data[i])) return -1;
    }
    return size;
}

int8_t jm_i2c_available(uint16_t wireId) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    if (wire->rx_index < wire->rx_len) {
        return wire->rx_len - wire->rx_index;
    }
    return 0;
}

int8_t jm_i2c_read(uint16_t wireId, uint8_t *buffer, uint16_t size) {
    i2c_wire_t *wire = i2c_find_wire(wireId);
    if (!wire || !wire->initialized) return -1;

    for (uint16_t i = 0; i < size; i++) {
        bool last = (i == size - 1);
        buffer[i] = i2cw_read(I2C1, !last);
    }

    if (wire->rx_index + size <= wire->rx_len) {
        wire->rx_index += size;
    }

    return (int8_t)size;
}

#endif // JM_I2C_WRAPPER_ENABLE==1

jm_emap_t *jm_stm32_ctrl_def(jm_emap_t *ps) {
    jm_emap_t *h = jm_emap_create(0);
    if (!h) return NULL;

    JM_LOG_D("ctrlTone");

    jm_emap_putInt(h, "code", 0, false);

    int8_t op = jm_emap_getInt(ps, "op", 0);
    
    switch (op) {
#if JM_TONE_ENABLE==1
        case 11: {
            uint32_t pin = jm_emap_getInt(ps, "p", 0);
            uint32_t freq = jm_emap_getInt(ps, "f", 0);
            uint32_t duration = jm_emap_getInt(ps, "d", 0);
            JM_LOG_D("tone pin=%d freq=%d dur=%d", pin, freq, duration);
            tone(pin, freq, duration);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 12: {
            uint32_t pin = jm_emap_getInt(ps, "p", 0);
            JM_LOG_D("noTone pin=%d", pin);
            noTone(pin);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }

        case 13:
        case 14: {
            uint32_t pin = jm_emap_getInt(ps, "p", 0);
            uint32_t state = jm_emap_getInt(ps, "s", 0);
            uint32_t timeout = jm_emap_getInt(ps, "t", 1000000);
            JM_LOG_D("pulseIn pin=%d state=%d timeout=%d", pin, state, timeout);
            uint32_t dur = (op == 13) ? tone_pulseIn(pin, state, timeout) : tone_pulseInLong(pin, state, timeout);
            jm_emap_putInt(h, "v", dur, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 15: {
            uint32_t dataPin = jm_emap_getInt(ps, "p", 0);
            uint32_t clockPin = jm_emap_getInt(ps, "c", 0);
            uint32_t bitOrder = jm_emap_getInt(ps, "b", 1);
            JM_LOG_D("shiftIn dataPin=%d clockPin=%d bitOrder=%d", dataPin, clockPin, bitOrder);
            uint8_t val = tone_shiftIn(dataPin, clockPin, (uint8_t)bitOrder);
            jm_emap_putInt(h, "v", val, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 16: {
            uint32_t dataPin = jm_emap_getInt(ps, "p", 0);
            uint32_t clockPin = jm_emap_getInt(ps, "c", 0);
            uint32_t bitOrder = jm_emap_getInt(ps, "b", 1);
            uint32_t val = jm_emap_getInt(ps, "v", 0);
            JM_LOG_D("shiftOut dataPin=%d clockPin=%d bitOrder=%d val=%d", dataPin, clockPin, bitOrder, val);
            tone_shiftOut(dataPin, clockPin, (uint8_t)bitOrder, (uint8_t)val);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_TONE_ENABLE==1

#if JM_STM32_INTERRUPT_ENABLE==1
        case 17: {
            JM_LOG_D("noInterrupts");
            __disable_irq();
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 18: {
            JM_LOG_D("interrupts");
            __enable_irq();
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_STM32_INTERRUPT_ENABLE==1

#if JM_I2C_WRAPPER_ENABLE==1
        case 45: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t address = (uint8_t)jm_emap_getInt(ps, "a", 0);
            int8_t ret = jm_i2c_begin(wireId, address);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 46: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint32_t clock = jm_emap_getInt(ps, "c", 100000);
            int8_t ret = jm_i2c_set_clock(wireId, clock);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 47: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t address = (uint8_t)jm_emap_getInt(ps, "a", 0);
            int8_t ret = jm_i2c_begin_transmission(wireId, address);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 48: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            bool releaseBus = jm_emap_getInt(ps, "r", 1) ? true : false;
            int8_t ret = jm_i2c_end_transmission(wireId, releaseBus);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 49: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t address = (uint8_t)jm_emap_getInt(ps, "a", 0);
            uint16_t size = jm_emap_getInt(ps, "s", 0);
            bool stop = jm_emap_getInt(ps, "p", 1) ? true : false;
            int8_t ret = jm_i2c_request_from(wireId, address, size, stop);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 50: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint8_t data = (uint8_t)jm_emap_getInt(ps, "d", 0);
            int8_t ret = jm_i2c_write_byte(wireId, data);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 51: {
            uint16_t size = jm_emap_getInt(ps, "s", 0);
            jm_emap_putInt(h, "v", size, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 52: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            int8_t ret = jm_i2c_available(wireId);
            jm_emap_putInt(h, "v", ret, false);
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
        case 53: {
            uint16_t wireId = jm_emap_getInt(ps, "i", 0);
            uint16_t size = jm_emap_getInt(ps, "s", 0);
            uint8_t buf[64];
            int8_t ret = jm_i2c_read(wireId, buf, size);
            if (ret > 0) {
                for (uint16_t i = 0; i < size && i < 64; i++) {
                    jm_emap_putByte(h, "v", (int8_t)buf[i], false);
                }
            }
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_I2C_WRAPPER_ENABLE==1

#if JM_AT24CXX_ENABLE==1
        case 54:
        case 55:
        case 56:
        case 57:
        case 58:
        case 59:
        {
            jm_emap_t *at24rst = jm_stm32_at24cxx_call(ps);
            if (at24rst) {
                jm_emap_putInt(h, "code", (int32_t)jm_emap_getByte(at24rst, (void*)"code", 0), false);
                if (jm_emap_exist(at24rst, (void*)"v")) {
                    jm_emap_putInt(h, "v", jm_emap_getInt(at24rst, (void*)"v", 0), false);
                }
                jm_emap_release(at24rst);
            }
            jm_emap_putInt(h, "status", 1, false);
            break;
        }
#endif // JM_AT24CXX_ENABLE==1

        default: {
            jm_emap_putInt(h, "code", 1, false);
            jm_emap_putStr(h, "msg", "Invalid op code", false, false);
            break;
        }
    }

    return h;
}

